In [45]:
import pandas as pd

In [46]:
Select *, denserank() over(order by salary) as rnk from Employee
where rnk=7

SyntaxError: invalid syntax (1415271375.py, line 1)

In [14]:
df=pd.DataFrame({'id': [1,2,3,4,5,6,7,8,9,10],
                'name':['a','b','c','d','e','h','i','j','k','g'],
                 'sal':[10000,12000,13000,14000,15000,6000,70000,80000,90000,100000]})

In [5]:
df

   id name     sal
0   1    a   10000
1   2    b   12000
2   3    c   13000
3   4    d   14000
4   5    e   15000
5   6    h    6000
6   7    i   70000
7   8    j   80000
8   9    k   90000
9  10    g  100000

In [6]:
df['new_sal']=df.sort_values(['sal'],ignore_index=True).groupby(['name']).cumcount()+1

In [7]:
df

   id name     sal  new_sal
0   1    a   10000        1
1   2    b   12000        1
2   3    c   13000        1
3   4    d   14000        1
4   5    e   15000        1
5   6    h    6000        1
6   7    i   70000        1
7   8    j   80000        1
8   9    k   90000        1
9  10    g  100000        1

In [8]:
df['sal1']=df['sal'].rank(method='dense')

In [9]:
df.set_index('sal1')

      id name     sal  new_sal
sal1
2.0    1    a   10000        1
3.0    2    b   12000        1
4.0    3    c   13000        1
5.0    4    d   14000        1
6.0    5    e   15000        1
1.0    6    h    6000        1
7.0    7    i   70000        1
8.0    8    j   80000        1
9.0    9    k   90000        1
10.0  10    g  100000        1

In [10]:
df.loc[7.0]

id             8
name           j
sal        80000
new_sal        1
sal1         8.0
Name: 7, dtype: object

In [12]:
df.drop('new_sal',axis=1,inplace=True)

In [15]:
df

   id name     sal
0   1    a   10000
1   2    b   12000
2   3    c   13000
3   4    d   14000
4   5    e   15000
5   6    h    6000
6   7    i   70000
7   8    j   80000
8   9    k   90000
9  10    g  100000

In [35]:
df['sal'].rank(method='dense',ascending=False)

0     9.0
1     8.0
2     7.0
3     6.0
4     5.0
5    10.0
6     4.0
7     3.0
8     2.0
9     1.0
Name: sal, dtype: float64

In [32]:
df[df['rank']==7]

   id name    sal  rank
2   3    c  13000   7.0

In [39]:
df.sort_values(by='sal', ascending=False)

   id name     sal  rank
9  10    g  100000   1.0
8   9    k   90000   2.0
7   8    j   80000   3.0
6   7    i   70000   4.0
4   5    e   15000   5.0
3   4    d   14000   6.0
2   3    c   13000   7.0
1   2    b   12000   8.0
0   1    a   10000   9.0
5   6    h    6000  10.0

In [ ]:
Find and return the maximum profit you can achieve.
Example 1:
Input: prices = [7,1,5,3,6,4]
Output: 7

In [5]:
def share(prices):
    max_prof = 0
    for i in range(1,len(prices)):
        if prices[i]>prices[i-1]:
            max_prof += prices[i] - prices[i-1]
    return max_prof

In [10]:
prices = [7,1,5,3,6,4]
share(prices)

7

In [27]:
# list sort

l=[1,2,34,44,5,3,8,4,4,57,89,100,13]

In [3]:
for i in range(len(l)):
    for j in range(i+1,len(l)):
        if l[i]>l[j]:
            l[i],l[j] = l[j],l[i]
print(l)

[1, 2, 3, 4, 4, 5, 8, 13, 33, 44, 57, 89, 100]

In [5]:
for i in range(len(l)):
    for j in range(i+1,len(l)):
        if l[i]<l[j]:
            l[i],l[j] = l[j],l[i]
print(l)

[100, 89, 57, 44, 33, 13, 8, 5, 4, 4, 3, 2, 1]

In [6]:
def fibo():
    a,b = 0,1
    while True:
        yield a
        a,b = b,a+b

In [7]:
obj=fibo()

In [11]:
next(obj)

2

In [47]:
p=[1,2,4,5,4,3]

In [51]:
#Q- raise exception  when find 33 in list l
sum=0
for i in p:
    if i == 3:
        raise Exception('unwanted value')
    else:
        sum += i
sum

Exception: unwanted value

In [52]:
l

[1, 2, 34, 44, 5, 3, 8, 4, 4, 57, 89, 100, 13]

In [54]:
#Q find max, min value without using predefine function
for i in range(len(l)):
    for j in range(i+1,len(l)):
        if l[i]>l[j]:
            l[i],l[j]=l[j],l[i]
print(l)
print('min', l[0])
print('max', l[-1])

[1, 2, 3, 4, 4, 5, 8, 13, 34, 44, 57, 89, 100]
min 1
max 100

In [74]:
s="acjdfdndfnissjxlkmxzndnijsdojq"

In [75]:
ch={'a':12,'b':11}
print(ch.get('a'))
print(max(ch.keys()))  #Finding the maximum value
print(max(ch, key=ch.get)) #Finding the key with the maximum value

12
b
a

In [76]:
#Q find max repeated charecter in string having o(n^2) complexity

ch1={}          
for i in s:
    if i in ch1:
        ch1[i]+=1
    else:
        ch1[i]=1
print(ch1)
print('max char : ',max(ch1, key=ch1.get))

{'a': 1, 'c': 1, 'j': 4, 'd': 5, 'f': 2, 'n': 4, 'i': 2, 's': 3, 'x': 2, 'l': 1, 'k': 1, 'm': 1, 'z': 1, 'o': 1, 'q': 1}
max char :  d

In [81]:
f={}
for i in s:
    if i in f:
        f[i]+=1
    else:
        f[i]=1
max_val = max(f, key=f.get)
min_val = min(f, key=f.get)
print(f"max value is : {max_val} and min value : {min_val}")

max value is : d and min value : a

In [5]:
a='5'+'5'
a

'55'

In [4]:
str1="@my #nam%e is Gau&rav"

In [5]:
str2=""
for i in str1:
    if ((i>='a' and i<='z') | (i>='A' and i<='Z') | (i==" ")):
#    if ((i>='a' and i<='z') or (i>='A' and i<='Z') or (i==" "))
        str2 = str2 + i
print(str2)

my name is Gaurav

In [6]:
#Q: 'my name is Gaurav' convert into 'Gaurav is name my'

In [7]:
s1=' '
str3= str2.split(' ')

In [8]:
l=str3[::-1]
s1=s1.join(l)
s1

'Gaurav is name my'

In [1]:
def fibo(n):
    if n<=1:
        return n
    else:
        return (fibo(n-1)+fibo(n-2))

nterm=int(input('enter num of term '))
if nterm <=0:
    print("enter positive number")
else:
    for i in range (nterm):
        print(fibo(i))

enter num of term 6
0
1
1
2
3
5

In [14]:
# Q- find the pair of two number from given list is equal to the value of k.

List=[1,2,3,5,4,58,22,95,967,45,896]
k=50

In [15]:
n=len(List)
for i in range(n):
    for j in range(i+1,n):
        if (List[i]+List[j])==k:
            print("addition of {} and {} is equal to {}".format(List[i],List[j],k))
        else:
            pass
print('thanks')

addition of 5 and 45 is equal to 50
thanks

In [17]:
Dict={100:'Apple', 102:'Banana', 103:'cake', 101:'Dog'} # Q- sort this dict

In [30]:
Dict2={}
K=list(Dict.keys())
K.sort()
print(K)
for i in K:
    Dict2[i]=Dict[i]
print(Dict2)

[100, 101, 102, 103]
{100: 'Apple', 101: 'Dog', 102: 'Banana', 103: 'cake'}

In [39]:
letter = input("enter name  ").lower()

def pelindrome(n):
    if letter[::-1]==letter:
        print(f"{letter} is penlindrome ")
    else :
        print (f"{letter} is not penlindrome")
        
pelindrome(letter)

enter name  level
level is penlindrome

In [44]:
S= input('enter the string  ').lower()
l=len(S)
x=0

for i in range(l):
    if S[i] != S[l-i-1]:
        x=1
        break
if x==0 :
    print(f"{S} is penlindrome ")
else:
    print (f"{S} is not penlindrome")

enter the string  Nitin
nitin is penlindrome